balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GB206.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCXORH" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CRCXORH" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="X16" edc:desc="" edc:mask="0x1" edc:name="X16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X17" edc:desc="" edc:mask="0x1" edc:name="X17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X18" edc:desc="" edc:mask="0x1" edc:name="X18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X19" edc:desc="" edc:mask="0x1" edc:name="X19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X20" edc:desc="" edc:mask="0x1" edc:name="X20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X21" edc:desc="" edc:mask="0x1" edc:name="X21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X22" edc:desc="" edc:mask="0x1" edc:name="X22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X23" edc:desc="" edc:mask="0x1" edc:name="X23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X24" edc:desc="" edc:mask="0x1" edc:name="X24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X25" edc:desc="" edc:mask="0x1" edc:name="X25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X26" edc:desc="" edc:mask="0x1" edc:name="X26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X27" edc:desc="" edc:mask="0x1" edc:name="X27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X28" edc:desc="" edc:mask="0x1" edc:name="X28" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X29" edc:desc="" edc:mask="0x1" edc:name="X29" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X30" edc:desc="" edc:mask="0x1" edc:name="X30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="X31" edc:desc="" edc:mask="0x1" edc:name="X31" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CRCDAT32" edc:desc="" edc:name="CRCDAT32" edc:nzwidth="0x20">
          <edc:SFRModeList/>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Integer"/>
          <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCDATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="CRCDATL" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
            <edc:AliasList>
              <edc:LegacyAlias edc:cname="CRCDAT"/>
            </edc:AliasList>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CRCDATL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCDATL" edc:nzwidth="16"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCDATH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="CRCDATH" edc:nzwidth="16" edc:por="xxxxxxxxxxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CRCDATH" edc:desc="" edc:mask="0xffff" edc:name="CRCDATH" edc:nzwidth="16"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCWDATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CRCWDATL" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CRCWDATL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCWDATL" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CRCWDATH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CRCWDATH" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CRCWDATH" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CRCWDATH" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="48"/>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR0" edc:desc="" edc:impl="0x3f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR0" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="INT1R" edc:desc="" edc:mask="0x3f" edc:name="INT1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="INT1R0" edc:desc="" edc:mask="0x1" edc:name="INT1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R1" edc:desc="" edc:mask="0x1" edc:name="INT1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R2" edc:desc="" edc:mask="0x1" edc:name="INT1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R3" edc:desc="" edc:mask="0x1" edc:name="INT1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R4" edc:desc="" edc:mask="0x1" edc:name="INT1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R5" edc:desc="" edc:mask="0x1" edc:name="INT1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR1" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR1" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2R" edc:desc="" edc:mask="0x3f" edc:name="INT2R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="INT3R" edc:desc="" edc:mask="0x3f" edc:name="INT3R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2R0" edc:desc="" edc:mask="0x1" edc:name="INT2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R1" edc:desc="" edc:mask="0x1" edc:name="INT2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R2" edc:desc="" edc:mask="0x1" edc:name="INT2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R3" edc:desc="" edc:mask="0x1" edc:name="INT2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R4" edc:desc="" edc:mask="0x1" edc:name="INT2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R5" edc:desc="" edc:mask="0x1" edc:name="INT2R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="INT3R0" edc:desc="" edc:mask="0x1" edc:name="INT3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT3R1" edc:desc="" edc:mask="0x1" edc:name="INT3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT3R2" edc:desc="" edc:mask="0x1" edc:name="INT3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT3R3" edc:desc="" edc:mask="0x1" edc:name="INT3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT3R4" edc:desc="" edc:mask="0x1" edc:name="INT3R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT3R5" edc:desc="" edc:mask="0x1" edc:name="INT3R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR2" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR2" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT4R" edc:desc="" edc:mask="0x3f" edc:name="INT4R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT4R0" edc:desc="" edc:mask="0x1" edc:name="INT4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4R1" edc:desc="" edc:mask="0x1" edc:name="INT4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4R2" edc:desc="" edc:mask="0x1" edc:name="INT4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT5R3" edc:desc="" edc:mask="0x1" edc:name="INT5R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4R4" edc:desc="" edc:mask="0x1" edc:name="INT4R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4R5" edc:desc="" edc:mask="0x1" edc:name="INT4R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR3" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR3" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CKR" edc:desc="" edc:mask="0x3f" edc:name="T2CKR" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR" edc:desc="" edc:mask="0x3f" edc:name="T3CKR" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2CKR0" edc:desc="" edc:mask="0x1" edc:name="T2CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR1" edc:desc="" edc:mask="0x1" edc:name="T2CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR2" edc:desc="" edc:mask="0x1" edc:name="T2CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR3" edc:desc="" edc:mask="0x1" edc:name="T2CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR4" edc:desc="" edc:mask="0x1" edc:name="T2CKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR5" edc:desc="" edc:mask="0x1" edc:name="T2CKR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T3CKR0" edc:desc="" edc:mask="0x1" edc:name="T3CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR1" edc:desc="" edc:mask="0x1" edc:name="T3CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR2" edc:desc="" edc:mask="0x1" edc:name="T3CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR3" edc:desc="" edc:mask="0x1" edc:name="T3CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR4" edc:desc="" edc:mask="0x1" edc:name="T3CKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR5" edc:desc="" edc:mask="0x1" edc:name="T3CKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR4" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR4" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKR" edc:desc="" edc:mask="0x3f" edc:name="T4CKR" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T5CKR" edc:desc="" edc:mask="0x3f" edc:name="T5CKR" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKR0" edc:desc="" edc:mask="0x1" edc:name="T4CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKR1" edc:desc="" edc:mask="0x1" edc:name="T4CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKR2" edc:desc="" edc:mask="0x1" edc:name="T4CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKR3" edc:desc="" edc:mask="0x1" edc:name="T4CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKR4" edc:desc="" edc:mask="0x1" edc:name="T4CKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKR5" edc:desc="" edc:mask="0x1" edc:name="T4CKR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T5CKR0" edc:desc="" edc:mask="0x1" edc:name="T5CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKR1" edc:desc="" edc:mask="0x1" edc:name="T5CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKR2" edc:desc="" edc:mask="0x1" edc:name="T5CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKR3" edc:desc="" edc:mask="0x1" edc:name="T5CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKR4" edc:desc="" edc:mask="0x1" edc:name="T5CKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKR5" edc:desc="" edc:mask="0x1" edc:name="T5CKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR7" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR7" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC1R" edc:desc="" edc:mask="0x3f" edc:name="IC1R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC2R" edc:desc="" edc:mask="0x3f" edc:name="IC2R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IC1R0" edc:desc="" edc:mask="0x1" edc:name="IC1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R1" edc:desc="" edc:mask="0x1" edc:name="IC1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R2" edc:desc="" edc:mask="0x1" edc:name="IC1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R3" edc:desc="" edc:mask="0x1" edc:name="IC1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R4" edc:desc="" edc:mask="0x1" edc:name="IC1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R5" edc:desc="" edc:mask="0x1" edc:name="IC1R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC2R0" edc:desc="" edc:mask="0x1" edc:name="IC2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R1" edc:desc="" edc:mask="0x1" edc:name="IC2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R2" edc:desc="" edc:mask="0x1" edc:name="IC2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R3" edc:desc="" edc:mask="0x1" edc:name="IC2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R4" edc:desc="" edc:mask="0x1" edc:name="IC2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R5" edc:desc="" edc:mask="0x1" edc:name="IC2R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR8" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR8" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC3R" edc:desc="" edc:mask="0x3f" edc:name="IC3R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC4R" edc:desc="" edc:mask="0x3f" edc:name="IC4R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IC3R0" edc:desc="" edc:mask="0x1" edc:name="IC3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R1" edc:desc="" edc:mask="0x1" edc:name="IC3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R2" edc:desc="" edc:mask="0x1" edc:name="IC3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R3" edc:desc="" edc:mask="0x1" edc:name="IC3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R4" edc:desc="" edc:mask="0x1" edc:name="IC3R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R5" edc:desc="" edc:mask="0x1" edc:name="IC3R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC4R0" edc:desc="" edc:mask="0x1" edc:name="IC4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC4R1" edc:desc="" edc:mask="0x1" edc:name="IC4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC4R2" edc:desc="" edc:mask="0x1" edc:name="IC4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC4R3" edc:desc="" edc:mask="0x1" edc:name="IC4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC4R4" edc:desc="" edc:mask="0x1" edc:name="IC4R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC4R5" edc:desc="" edc:mask="0x1" edc:name="IC4R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR9" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR9" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC5R" edc:desc="" edc:mask="0x3f" edc:name="IC5R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC6R" edc:desc="" edc:mask="0x3f" edc:name="IC6R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IC5R0" edc:desc="" edc:mask="0x1" edc:name="IC5R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC5R1" edc:desc="" edc:mask="0x1" edc:name="IC5R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC5R2" edc:desc="" edc:mask="0x1" edc:name="IC5R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC5R3" edc:desc="" edc:mask="0x1" edc:name="IC5R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC5R4" edc:desc="" edc:mask="0x1" edc:name="IC5R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC5R5" edc:desc="" edc:mask="0x1" edc:name="IC5R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IC6R0" edc:desc="" edc:mask="0x1" edc:name="IC6R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC6R1" edc:desc="" edc:mask="0x1" edc:name="IC6R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC6R2" edc:desc="" edc:mask="0x1" edc:name="IC6R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC6R3" edc:desc="" edc:mask="0x1" edc:name="IC6R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC6R4" edc:desc="" edc:mask="0x1" edc:name="IC6R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC6R5" edc:desc="" edc:mask="0x1" edc:name="IC6R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
