balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GB206.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR12" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR12" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP24R" edc:desc="" edc:mask="0x3f" edc:name="RP24R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP25R" edc:desc="" edc:mask="0x3f" edc:name="RP25R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP24R0" edc:desc="" edc:mask="0x1" edc:name="RP24R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R1" edc:desc="" edc:mask="0x1" edc:name="RP24R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R2" edc:desc="" edc:mask="0x1" edc:name="RP24R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R3" edc:desc="" edc:mask="0x1" edc:name="RP24R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R4" edc:desc="" edc:mask="0x1" edc:name="RP24R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP24R5" edc:desc="" edc:mask="0x1" edc:name="RP24R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP25R0" edc:desc="" edc:mask="0x1" edc:name="RP25R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R1" edc:desc="" edc:mask="0x1" edc:name="RP25R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R2" edc:desc="" edc:mask="0x1" edc:name="RP25R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R3" edc:desc="" edc:mask="0x1" edc:name="RP25R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R4" edc:desc="" edc:mask="0x1" edc:name="RP25R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP25R5" edc:desc="" edc:mask="0x1" edc:name="RP25R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR13" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR13" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP26R" edc:desc="" edc:mask="0x3f" edc:name="RP26R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP27R" edc:desc="" edc:mask="0x3f" edc:name="RP27R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP26R0" edc:desc="" edc:mask="0x1" edc:name="RP26R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R1" edc:desc="" edc:mask="0x1" edc:name="RP26R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R2" edc:desc="" edc:mask="0x1" edc:name="RP26R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R3" edc:desc="" edc:mask="0x1" edc:name="RP26R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R4" edc:desc="" edc:mask="0x1" edc:name="RP26R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP26R5" edc:desc="" edc:mask="0x1" edc:name="RP26R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP27R0" edc:desc="" edc:mask="0x1" edc:name="RP27R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R1" edc:desc="" edc:mask="0x1" edc:name="RP27R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R2" edc:desc="" edc:mask="0x1" edc:name="RP27R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R3" edc:desc="" edc:mask="0x1" edc:name="RP27R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R4" edc:desc="" edc:mask="0x1" edc:name="RP27R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP27R5" edc:desc="" edc:mask="0x1" edc:name="RP27R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR14" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR14" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP28R" edc:desc="" edc:mask="0x3f" edc:name="RP28R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP29R" edc:desc="" edc:mask="0x3f" edc:name="RP29R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP28R0" edc:desc="" edc:mask="0x1" edc:name="RP28R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R1" edc:desc="" edc:mask="0x1" edc:name="RP28R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R2" edc:desc="" edc:mask="0x1" edc:name="RP28R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R3" edc:desc="" edc:mask="0x1" edc:name="RP28R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R4" edc:desc="" edc:mask="0x1" edc:name="RP28R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP28R5" edc:desc="" edc:mask="0x1" edc:name="RP28R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP29R0" edc:desc="" edc:mask="0x1" edc:name="RP29R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R1" edc:desc="" edc:mask="0x1" edc:name="RP29R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R2" edc:desc="" edc:mask="0x1" edc:name="RP29R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R3" edc:desc="" edc:mask="0x1" edc:name="RP29R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R4" edc:desc="" edc:mask="0x1" edc:name="RP29R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP29R5" edc:desc="" edc:mask="0x1" edc:name="RP29R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="98"/>
        <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xc0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----0000000011" edc:name="RCON" edc:nzwidth="0x10" edc:por="00----0000000011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM" edc:desc="" edc:mask="0x1" edc:name="CM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOPUWR" edc:desc="" edc:mask="0x1" edc:name="IOPUWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRAPR" edc:desc="" edc:mask="0x1" edc:name="TRAPR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="PMSLP" edc:desc="" edc:mask="0x1" edc:name="PMSLP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrr-nnnsnr-cnnn" edc:cname="OSCCON" edc:desc="" edc:impl="0x77ab" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-yyy00000000" edc:name="OSCCON" edc:nzwidth="0x10" edc:por="-000-yyy00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POSCEN" edc:desc="" edc:mask="0x1" edc:name="POSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x7" edc:name="COSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LPOSCEN" edc:desc="" edc:mask="0x1" edc:name="LPOSCEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:desc="" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:desc="" edc:mask="0x1" edc:name="NOSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:desc="" edc:mask="0x1" edc:name="NOSC2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:desc="" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:desc="" edc:mask="0x1" edc:name="COSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC2" edc:desc="" edc:mask="0x1" edc:name="COSC2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
